tutorials/fluids/immersedBoundary/oscillatingCylinderInChannel/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Immersed oscillating cylinder, see src/immersedBoundary/README.md
immersedBoundary
{
    type            immersedBoundaryForce;

    // Sharp interface penalisation with the fluid cells next to the
    // surface penalised along the cell links cut by the surface (the
    // default), with the force from the surface traction, the most accurate
    // for an accelerating body (the momentum exchange is written in columns
    // 11-13 of the force file); the other methods are available for
    // comparison with
    //     method          penalty;
    //     method          incremental;
    //     couplingCoeff   0.8;
    // and "occupancy vertexFraction;" for the body with incremental
    method          cutLink;
    forceEstimator  surfaceTraction;

    bodies
    {
        cylinder
        {
            // Diameter 0.1 m, centred at (1.1, 0.2) m at t = 0, extending
            // beyond the mesh in the z direction
            surface     "cylinder.stl";

            // x = 1.1 + 0.25 sin(2 pi t/4) m
            motion
            {
                type        sinusoidalTranslation;
                amplitude   0.25;
                period      4;
                direction   (1 0 0);
            }
        }
    }
}

// ************************************************************************* //
